In [2]:
import sqlite3
import pandas as pd

In [3]:
# Crear un conector a la base de datos chinook
db_name = 'chinook.db'
conn = sqlite3.connect(db_name)

In [4]:
cursor = conn.cursor()

In [5]:
query_st = '''
SELECT *
FROM albums
'''

In [6]:
query = cursor.execute(query_st)

In [7]:
query.fetchall()

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3),
 (6, 'Jagged Little Pill', 4),
 (7, 'Facelift', 5),
 (8, 'Warner 25 Anos', 6),
 (9, 'Plays Metallica By Four Cellos', 7),
 (10, 'Audioslave', 8),
 (11, 'Out Of Exile', 8),
 (12, 'BackBeat Soundtrack', 9),
 (13, 'The Best Of Billy Cobham', 10),
 (14, 'Alcohol Fueled Brewtality Live! [Disc 1]', 11),
 (15, 'Alcohol Fueled Brewtality Live! [Disc 2]', 11),
 (16, 'Black Sabbath', 12),
 (17, 'Black Sabbath Vol. 4 (Remaster)', 12),
 (18, 'Body Count', 13),
 (19, 'Chemical Wedding', 14),
 (20, 'The Best Of Buddy Guy - The Millenium Collection', 15),
 (21, 'Prenda Minha', 16),
 (22, 'Sozinho Remix Ao Vivo', 16),
 (23, 'Minha Historia', 17),
 (24, 'Afrociberdelia', 18),
 (25, 'Da Lama Ao Caos', 18),
 (26, 'Acústico MTV [Live]', 19),
 (27, 'Cidade Negra - Hits', 19),
 (28, 'Na Pista', 20),
 (29, 'Axé Bahia 2001', 21),
 (30, 'BBC Sessions [Disc 1] [Live]', 22),
 (31, 'Bongo Fury', 23),
 (32, 'Carnaval 2001', 21),
 (33, 'Chill: Brazil (Disc 1)', 24),
 (34, 'Chill: Brazil (Disc 2)', 6),
 (35, 'Garage Inc. (Disc 1)', 50),
 (36, 'Greatest Hits II', 51),
 (37, 'Greatest Kiss', 52),
 (38, 'Heart of the Night', 53),
 (39, 'International Superhits', 54),
 (40, 'Into The Light', 55),
 (41, 'Meus Momentos', 56),
 (42, 'Minha História', 57),
 (43, 'MK III The Final Concerts [Disc 1]', 58),
 (44, 'Physical Graffiti [Disc 1]', 22),
 (45, 'Sambas De Enredo 2001', 21),
 (46, 'Supernatural', 59),
 (47, 'The Best of Ed Motta', 37),
 (48, 'The Essential Miles Davis [Disc 1]', 68),
 (49, 'The Essential Miles Davis [Disc 2]', 68),
 (50, 'The Final Concerts (Disc 2)', 58),
 (51, "Up An' Atom", 69),
 (52, 'Vinícius De Moraes - Sem Limite', 70),
 (53, 'Vozes do MPB', 21),
 (54, 'Chronicle, Vol. 1', 76),
 (55, 'Chronicle, Vol. 2', 76),
 (56, 'Cássia Eller - Coleção Sem Limite [Disc 2]', 77),
 (57, 'Cássia Eller - Sem Limite [Disc 1]', 77),
 (58, 'Come Taste The Band', 58),
 (59, 'Deep Purple In Rock', 58),
 (60, 'Fireball', 58),
 (61, "Knocking at Your Back Door: The Best Of Deep Purple in the 80's", 58),
 (62, 'Machine Head', 58),
 (63, 'Purpendicular', 58),
 (64, 'Slaves And Masters', 58),
 (65, 'Stormbringer', 58),
 (66, 'The Battle Rages On', 58),
 (67, "Vault: Def Leppard's Greatest Hits", 78),
 (68, 'Outbreak', 79),
 (69, 'Djavan Ao Vivo - Vol. 02', 80),
 (70, 'Djavan Ao Vivo - Vol. 1', 80),
 (71, 'Elis Regina-Minha História', 41),
 (72, 'The Cream Of Clapton', 81),
 (73, 'Unplugged', 81),
 (74, 'Album Of The Year', 82),
 (75, 'Angel Dust', 82),
 (76, 'King For A Day Fool For A Lifetime', 82),
 (77, 'The Real Thing', 82),
 (78, 'Deixa Entrar', 83),
 (79, 'In Your Honor [Disc 1]', 84),
 (80, 'In Your Honor [Disc 2]', 84),
 (81, 'One By One', 84),
 (82, 'The Colour And The Shape', 84),
 (83, 'My Way: The Best Of Frank Sinatra [Disc 1]', 85),
 (84, 'Roda De Funk', 86),
 (85, 'As Canções de Eu Tu Eles', 27),
 (86, 'Quanta Gente Veio Ver (Live)', 27),
 (87, 'Quanta Gente Veio ver--Bônus De Carnaval', 27),
 (88, 'Faceless', 87),
 (89, 'American Idiot', 54),
 (90, 'Appetite for Destruction', 88),
 (91, 'Use Your Illusion I', 88),
 (92, 'Use Your Illusion II', 88),
 (93, 'Blue Moods', 89),
 (94, 'A Matter of Life and Death', 90),
 (95, 'A Real Dead One', 90),
 (96, 'A Real Live One', 90),
 (97, 'Brave New World', 90),
 (98, 'Dance Of Death', 90),
 (99, 'Fear Of The Dark', 90),
 (100, 'Iron Maiden', 90),
 (101, 'Killers', 90),
 (102, 'Live After Death', 90),
 (103, 'Live At Donington 1992 (Disc 1)', 90),
 (104, 'Live At Donington 1992 (Disc 2)', 90),
 (105, 'No Prayer For The Dying', 90),
 (106, 'Piece Of Mind', 90),
 (107, 'Powerslave', 90),
 (108, 'Rock In Rio [CD1]', 90),
 (109, 'Rock In Rio [CD2]', 90),
 (110, 'Seventh Son of a Seventh Son', 90),
 (111, 'Somewhere in Time', 90),
 (112, 'The Number of The Beast', 90),
 (113, 'The X Factor', 90),
 (114, 'Virtual XI', 90),
 (115, 'Sex Machine', 91),
 (116, 'Emergency On Planet Earth', 92),
 (117, 'Synkronized', 92),
 (118, 'The Return Of The Space Cowboy', 92),
 (119, 'Get Born', 93),
 (120, 'Are You Experienced?', 94),
 (121, 'Surfing with the Alien (Remastered)', 95),
 (122, 'Jorge Ben Jor 25 Anos', 46),
 (123, 'Jota Quest-1995', 96),
 (124, 'Cafezinho', 97),
 (125, 'Living After Midnight', 98),
 (126, 'Unplugged [Live]', 52),
 (127, 'BBC Sessions [Disc 2] [Live]', 22),
 (128, 'Coda', 22),
 (129, 'Houses Of The Holy', 22),
 (130, 'In Through The Out Door', 22),
 (131, 'IV', 22),
 (132, 'Led Zeppelin I', 22),
 (133, 'Led Zeppelin II', 22),
 (134, 'Led Zeppelin III', 22),
 (135, 'Physical Graffiti [Disc 2]', 22),
 (136, 'Presence', 22),
 (137, 'The Song Remains The Same (Disc 1)', 22),
 (138, 'The Song Remains The Same (Disc 2)', 22),
 (139, 'A TempestadeTempestade Ou O Livro Dos Dias', 99),
 (140, 'Mais Do Mesmo', 99),
 (141, 'Greatest Hits', 100),
 (142, 'Lulu Santos - RCA 100 Anos De Música - Álbum 01', 101),
 (143, 'Lulu Santos - RCA 100 Anos De Música - Álbum 02', 101),
 (144, 'Misplaced Childhood', 102),
 (145, 'Barulhinho Bom', 103),
 (146, 'Seek And Shall Find: More Of The Best (1963-1981)', 104),
 (147, 'The Best Of Men At Work', 105),
 (148, 'Black Album', 50),
 (149, 'Garage Inc. (Disc 2)', 50),
 (150, "Kill 'Em All", 50),
 (151, 'Load', 50),
 (152, 'Master Of Puppets', 50),
 (153, 'ReLoad', 50),
 (154, 'Ride The Lightning', 50),
 (155, 'St. Anger', 50),
 (156, '...And Justice For All', 50),
 (157, 'Miles Ahead', 68),
 (158, 'Milton Nascimento Ao Vivo', 42),
 (159, 'Minas', 42),
 (160, 'Ace Of Spades', 106),
 (161, 'Demorou...', 108),
 (162, 'Motley Crue Greatest Hits', 109),
 (163, 'From The Muddy Banks Of The Wishkah [Live]', 110),
 (164, 'Nevermind', 110),
 (165, 'Compositores', 111),
 (166, 'Olodum', 112),
 (167, 'Acústico MTV', 113),
 (168, 'Arquivo II', 113),
 (169, 'Arquivo Os Paralamas Do Sucesso', 113),
 (170, 'Bark at the Moon (Remastered)', 114),
 (171, 'Blizzard of Ozz', 114),
 (172, 'Diary of a Madman (Remastered)', 114),
 (173, 'No More Tears (Remastered)', 114),
 (174, 'Tribute', 114),
 (175, 'Walking Into Clarksdale', 115),
 (176, 'Original Soundtracks 1', 116),
 (177, 'The Beast Live', 117),
 (178, 'Live On Two Legs [Live]', 118),
 (179, 'Pearl Jam', 118),
 (180, 'Riot Act', 118),
 (181, 'Ten', 118),
 (182, 'Vs.', 118),
 (183, 'Dark Side Of The Moon', 120),
 (184, 'Os Cães Ladram Mas A Caravana Não Pára', 121),
 (185, 'Greatest Hits I', 51),
 (186, 'News Of The World', 51),
 (187, 'Out Of Time', 122),
 (188, 'Green', 124),
 (189, 'New Adventures In Hi-Fi', 124),
 (190, 'The Best Of R.E.M.: The IRS Years', 124),
 (191, 'Cesta Básica', 125),
 (192, 'Raul Seixas', 126),
 (193, 'Blood Sugar Sex Magik', 127),
 (194, 'By The Way', 127),
 (195, 'Californication', 127),
 (196, 'Retrospective I (1974-1980)', 128),
 (197, 'Santana - As Years Go By', 59),
 (198, 'Santana Live', 59),
 (199, 'Maquinarama', 130),
 (200, 'O Samba Poconé', 130),
 (201, 'Judas 0: B-Sides and Rarities', 131),
 (202, 'Rotten Apples: Greatest Hits', 131),
 (203, 'A-Sides', 132),
 (204, 'Morning Dance', 53),
 (205, 'In Step', 133),
 (206, 'Core', 134),
 (207, 'Mezmerize', 135),
 (208, '[1997] Black Light Syndrome', 136),
 (209, 'Live [Disc 1]', 137),
 (210, 'Live [Disc 2]', 137),
 (211, 'The Singles', 138),
 (212, 'Beyond Good And Evil', 139),
 (213,
  'Pure Cult: The Best Of The Cult (For Rockers, Ravers, Lovers & Sinners) [UK]',
  139),
 (214, 'The Doors', 140),
 (215, 'The Police Greatest Hits', 141),
 (216, 'Hot Rocks, 1964-1971 (Disc 1)', 142),
 (217, 'No Security', 142),
 (218, 'Voodoo Lounge', 142),
 (219, 'Tangents', 143),
 (220, 'Transmission', 143),
 (221, 'My Generation - The Very Best Of The Who', 144),
 (222, 'Serie Sem Limite (Disc 1)', 145),
 (223, 'Serie Sem Limite (Disc 2)', 145),
 (224, 'Acústico', 146),
 (225, 'Volume Dois', 146),
 (226, 'Battlestar Galactica: The Story So Far', 147),
 (227, 'Battlestar Galactica, Season 3', 147),
 (228, 'Heroes, Season 1', 148),
 (229, 'Lost, Season 3', 149),
 (230, 'Lost, Season 1', 149),
 (231, 'Lost, Season 2', 149),
 (232, 'Achtung Baby', 150),
 (233, "All That You Can't Leave Behind", 150),
 (234, 'B-Sides 1980-1990', 150),
 (235, 'How To Dismantle An Atomic Bomb', 150),
 (236, 'Pop', 150),
 (237, 'Rattle And Hum', 150),
 (238, 'The Best Of 1980-1990', 150),
 (239, 'War', 150),
 (240, 'Zooropa', 150),
 (241, 'UB40 The Best Of - Volume Two [UK]', 151),
 (242, 'Diver Down', 152),
 (243, 'The Best Of Van Halen, Vol. I', 152),
 (244, 'Van Halen', 152),
 (245, 'Van Halen III', 152),
 (246, 'Contraband', 153),
 (247, 'Vinicius De Moraes', 72),
 (248, 'Ao Vivo [IMPORT]', 155),
 (249, 'The Office, Season 1', 156),
 (250, 'The Office, Season 2', 156),
 (251, 'The Office, Season 3', 156),
 (252, 'Un-Led-Ed', 157),
 (253, 'Battlestar Galactica (Classic), Season 1', 158),
 (254, 'Aquaman', 159),
 (255,
  'Instant Karma: The Amnesty International Campaign to Save Darfur',
  150),
 (256, 'Speak of the Devil', 114),
 (257,
  '20th Century Masters - The Millennium Collection: The Best of Scorpions',
  179),
 (258, 'House of Pain', 180),
 (259,
  'Radio Brasil (O Som da Jovem Vanguarda) - Seleccao de Henrique Amaro',
  36),
 (260, 'Cake: B-Sides and Rarities', 196),
 (261, 'LOST, Season 4', 149),
 (262, 'Quiet Songs', 197),
 (263, 'Muso Ko', 198),
 (264, 'Realize', 199),
 (265, 'Every Kind of Light', 200),
 (266, 'Duos II', 201),
 (267, 'Worlds', 202),
 (268, 'The Best of Beethoven', 203),
 (269, 'Temple of the Dog', 204),
 (270, 'Carry On', 205),
 (271, 'Revelations', 8),
 (272, 'Adorate Deum: Gregorian Chant from the Proper of the Mass', 206),
 (273, 'Allegri: Miserere', 207),
 (274, 'Pachelbel: Canon & Gigue', 208),
 (275, 'Vivaldi: The Four Seasons', 209),
 (276, 'Bach: Violin Concertos', 210),
 (277, 'Bach: Goldberg Variations', 211),
 (278, 'Bach: The Cello Suites', 212),
 (279, 'Handel: The Messiah (Highlights)', 213),
 (280, 'The World of Classical Favourites', 214),
 (281, 'Sir Neville Marriner: A Celebration', 215),
 (282, 'Mozart: Wind Concertos', 216),
 (283, 'Haydn: Symphonies 99 - 104', 217),
 (284, 'Beethoven: Symhonies Nos. 5 & 6', 218),
 (285, 'A Soprano Inspired', 219),
 (286, 'Great Opera Choruses', 220),
 (287, 'Wagner: Favourite Overtures', 221),
 (288, 'Fauré: Requiem, Ravel: Pavane & Others', 222),
 (289, 'Tchaikovsky: The Nutcracker', 223),
 (290, 'The Last Night of the Proms', 224),
 (291, 'Puccini: Madama Butterfly - Highlights', 225),
 (292, 'Holst: The Planets, Op. 32 & Vaughan Williams: Fantasies', 226),
 (293, "Pavarotti's Opera Made Easy", 227),
 (294,
  "Great Performances - Barber's Adagio and Other Romantic Favorites for Strings",
  228),
 (295, 'Carmina Burana', 229),
 (296, 'A Copland Celebration, Vol. I', 230),
 (297, 'Bach: Toccata & Fugue in D Minor', 231),
 (298, 'Prokofiev: Symphony No.1', 232),
 (299, 'Scheherazade', 233),
 (300, 'Bach: The Brandenburg Concertos', 234),
 (301, 'Chopin: Piano Concertos Nos. 1 & 2', 235),
 (302, 'Mascagni: Cavalleria Rusticana', 236),
 (303, 'Sibelius: Finlandia', 237),
 (304, 'Beethoven Piano Sonatas: Moonlight & Pastorale', 238),
 (305, 'Great Recordings of the Century - Mahler: Das Lied von der Erde', 240),
 (306, 'Elgar: Cello Concerto & Vaughan Williams: Fantasias', 241),
 (307, 'Adams, John: The Chairman Dances', 242),
 (308,
  "Tchaikovsky: 1812 Festival Overture, Op.49, Capriccio Italien & Beethoven: Wellington's Victory",
  243),
 (309, 'Palestrina: Missa Papae Marcelli & Allegri: Miserere', 244),
 (310, 'Prokofiev: Romeo & Juliet', 245),
 (311, 'Strauss: Waltzes', 226),
 (312, 'Berlioz: Symphonie Fantastique', 245),
 (313, 'Bizet: Carmen Highlights', 246),
 (314, 'English Renaissance', 247),
 (315, 'Handel: Music for the Royal Fireworks (Original Version 1749)', 208),
 (316, 'Grieg: Peer Gynt Suites & Sibelius: Pelléas et Mélisande', 248),
 (317, 'Mozart Gala: Famous Arias', 249),
 (318, 'SCRIABIN: Vers la flamme', 250),
 (319, 'Armada: Music from the Courts of England and Spain', 251),
 (320, 'Mozart: Symphonies Nos. 40 & 41', 248),
 (321, 'Back to Black', 252),
 (322, 'Frank', 252),
 (323, 'Carried to Dust (Bonus Track Version)', 253),
 (324, "Beethoven: Symphony No. 6 'Pastoral' Etc.", 254),
 (325, 'Bartok: Violin & Viola Concertos', 255),
 (326, "Mendelssohn: A Midsummer Night's Dream", 256),
 (327, 'Bach: Orchestral Suites Nos. 1 - 4', 257),
 (328, 'Charpentier: Divertissements, Airs & Concerts', 258),
 (329, 'South American Getaway', 259),
 (330, 'Górecki: Symphony No. 3', 260),
 (331, 'Purcell: The Fairy Queen', 261),
 (332, 'The Ultimate Relexation Album', 262),
 (333, 'Purcell: Music for the Queen Mary', 263),
 (334, 'Weill: The Seven Deadly Sins', 264),
 (335,
  'J.S. Bach: Chaconne, Suite in E Minor, Partita in E Major & Prelude, Fugue and Allegro',
  265),
 (336, 'Prokofiev: Symphony No.5 & Stravinksy: Le Sacre Du Printemps', 248),
 (337, 'Szymanowski: Piano Works, Vol. 1', 266),
 (338, 'Nielsen: The Six Symphonies', 267),
 (339, "Great Recordings of the Century: Paganini's 24 Caprices", 268),
 (340, "Liszt - 12 Études D'Execution Transcendante", 269),
 (341,
  'Great Recordings of the Century - Shubert: Schwanengesang, 4 Lieder',
  270),
 (342, 'Locatelli: Concertos for Violin, Strings and Continuo, Vol. 3', 271),
 (343, 'Respighi:Pines of Rome', 226),
 (344, "Schubert: The Late String Quartets & String Quintet (3 CD's)", 272),
 (345, "Monteverdi: L'Orfeo", 273),
 (346, 'Mozart: Chamber Music', 274),
 (347, 'Koyaanisqatsi (Soundtrack from the Motion Picture)', 275)]

In [8]:
query2 = cursor.execute('SELECT name FROM sqlite_master WHERE type = \'table\';')

In [9]:
query2.fetchall()

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',),
 ('films',),
 ('new_table',),
 ('nueva_tabla',)]

In [10]:
pd.read_sql_query(query_st, conn)

     AlbumId                                              Title  ArtistId
0          1              For Those About To Rock We Salute You         1
1          2                                  Balls to the Wall         2
2          3                                  Restless and Wild         2
3          4                                  Let There Be Rock         1
4          5                                           Big Ones         3
..       ...                                                ...       ...
342      343                             Respighi:Pines of Rome       226
343      344  Schubert: The Late String Quartets & String Qu...       272
344      345                                Monteverdi: L'Orfeo       273
345      346                              Mozart: Chamber Music       274
346      347  Koyaanisqatsi (Soundtrack from the Motion Pict...       275

[347 rows x 3 columns]

In [11]:
query = '''
SELECT *
FROM customers, invoices
WHERE customers.CustomerId = invoices.CustomerId
'''
pd.read_sql_query(query, conn)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,...,SupportRepId,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
407,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,45,59,2009-07-08 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,5.94
408,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,97,59,2010-02-26 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.99
409,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,218,59,2011-08-20 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.98
410,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,229,59,2011-09-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,13.86
411,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,284,59,2012-05-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,8.91

In [12]:
# lo mismo pero de otra forma, usando aliases esta vez
query = '''
SELECT c.LastName
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
'''
pd.read_sql_query(query, conn)

       LastName
0     Gonçalves
1     Gonçalves
2     Gonçalves
3     Gonçalves
4     Gonçalves
..          ...
407  Srivastava
408  Srivastava
409  Srivastava
410  Srivastava
411  Srivastava

[412 rows x 1 columns]

# Ejercicios pdf (Segunda Parte)

## Ex1

In [13]:
query = '''
SELECT c.FirstName || ' ' || c.LastName as 'Client Name', i.InvoiceId, i.InvoiceDate, i.BillingCountry
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE c.Country = 'Brazil'
'''
pd.read_sql_query(query, conn)

        Client Name  InvoiceId          InvoiceDate BillingCountry
0    Luís Gonçalves         98  2010-03-11 00:00:00         Brazil
1    Luís Gonçalves        121  2010-06-13 00:00:00         Brazil
2    Luís Gonçalves        143  2010-09-15 00:00:00         Brazil
3    Luís Gonçalves        195  2011-05-06 00:00:00         Brazil
4    Luís Gonçalves        316  2012-10-27 00:00:00         Brazil
5    Luís Gonçalves        327  2012-12-07 00:00:00         Brazil
6    Luís Gonçalves        382  2013-08-07 00:00:00         Brazil
7   Eduardo Martins         25  2009-04-09 00:00:00         Brazil
8   Eduardo Martins        154  2010-11-14 00:00:00         Brazil
9   Eduardo Martins        177  2011-02-16 00:00:00         Brazil
10  Eduardo Martins        199  2011-05-21 00:00:00         Brazil
11  Eduardo Martins        251  2012-01-09 00:00:00         Brazil
12  Eduardo Martins        372  2013-07-02 00:00:00         Brazil
13  Eduardo Martins        383  2013-08-12 00:00:00         Brazil
14  Alexandre Rocha         57  2009-09-06 00:00:00         Brazil
15  Alexandre Rocha         68  2009-10-17 00:00:00         Brazil
16  Alexandre Rocha        123  2010-06-17 00:00:00         Brazil
17  Alexandre Rocha        252  2012-01-22 00:00:00         Brazil
18  Alexandre Rocha        275  2012-04-25 00:00:00         Brazil
19  Alexandre Rocha        297  2012-07-28 00:00:00         Brazil
20  Alexandre Rocha        349  2013-03-18 00:00:00         Brazil
21  Roberto Almeida         34  2009-05-23 00:00:00         Brazil
22  Roberto Almeida        155  2010-11-14 00:00:00         Brazil
23  Roberto Almeida        166  2010-12-25 00:00:00         Brazil
24  Roberto Almeida        221  2011-08-25 00:00:00         Brazil
25  Roberto Almeida        350  2013-03-31 00:00:00         Brazil
26  Roberto Almeida        373  2013-07-03 00:00:00         Brazil
27  Roberto Almeida        395  2013-10-05 00:00:00         Brazil
28   Fernanda Ramos         35  2009-06-05 00:00:00         Brazil
29   Fernanda Ramos         58  2009-09-07 00:00:00         Brazil
30   Fernanda Ramos         80  2009-12-10 00:00:00         Brazil
31   Fernanda Ramos        132  2010-07-31 00:00:00         Brazil
32   Fernanda Ramos        253  2012-01-22 00:00:00         Brazil
33   Fernanda Ramos        264  2012-03-03 00:00:00         Brazil
34   Fernanda Ramos        319  2012-11-01 00:00:00         Brazil

## Ex2

In [14]:
query = '''
SELECT c.FirstName || ' ' || c.LastName as 'Client Name', c.Country as 'Client Country', i.InvoiceId, i.Total
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE c.Country = 'Brazil'
'''
pd.read_sql_query(query, conn)

        Client Name Client Country  InvoiceId  Total
0    Luís Gonçalves         Brazil         98   3.98
1    Luís Gonçalves         Brazil        121   3.96
2    Luís Gonçalves         Brazil        143   5.94
3    Luís Gonçalves         Brazil        195   0.99
4    Luís Gonçalves         Brazil        316   1.98
5    Luís Gonçalves         Brazil        327  13.86
6    Luís Gonçalves         Brazil        382   8.91
7   Eduardo Martins         Brazil         25   8.91
8   Eduardo Martins         Brazil        154   1.98
9   Eduardo Martins         Brazil        177   3.96
10  Eduardo Martins         Brazil        199   5.94
11  Eduardo Martins         Brazil        251   0.99
12  Eduardo Martins         Brazil        372   1.98
13  Eduardo Martins         Brazil        383  13.86
14  Alexandre Rocha         Brazil         57   1.98
15  Alexandre Rocha         Brazil         68  13.86
16  Alexandre Rocha         Brazil        123   8.91
17  Alexandre Rocha         Brazil        252   1.98
18  Alexandre Rocha         Brazil        275   3.96
19  Alexandre Rocha         Brazil        297   5.94
20  Alexandre Rocha         Brazil        349   0.99
21  Roberto Almeida         Brazil         34   0.99
22  Roberto Almeida         Brazil        155   1.98
23  Roberto Almeida         Brazil        166  13.86
24  Roberto Almeida         Brazil        221   8.91
25  Roberto Almeida         Brazil        350   1.98
26  Roberto Almeida         Brazil        373   3.96
27  Roberto Almeida         Brazil        395   5.94
28   Fernanda Ramos         Brazil         35   1.98
29   Fernanda Ramos         Brazil         58   3.96
30   Fernanda Ramos         Brazil         80   5.94
31   Fernanda Ramos         Brazil        132   0.99
32   Fernanda Ramos         Brazil        253   1.98
33   Fernanda Ramos         Brazil        264  13.86
34   Fernanda Ramos         Brazil        319   8.91

## Ex3

In [15]:
query = '''
SELECT e.FirstName || ' ' || e.LastName as 'Nombre Empleado', i.*
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
'''
pd.read_sql_query(query, conn)

,Nombre Empleado,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,Jane Peacock,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,Jane Peacock,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,Jane Peacock,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,Jane Peacock,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,Jane Peacock,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
...,...,...,...,...,...,...,...,...,...,...
407,Steve Johnson,88,57,2010-01-13 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,17.91
408,Steve Johnson,217,57,2011-08-20 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,1.98
409,Steve Johnson,240,57,2011-11-22 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,3.96
410,Steve Johnson,262,57,2012-02-24 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,5.94
411,Steve Johnson,314,57,2012-10-14 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,0.99

## Ex4

In [16]:
query = '''
SELECT c.FirstName || ' ' || c.LastName as 'Client Name', c.Country, e.FirstName || ' ' || e.LastName as 'Agent Name', i.Total
FROM customers c
JOIN employees e ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE e.Title = 'Sales Support Agent'
'''
pd.read_sql_query(query, conn)

        Client Name Country     Agent Name  Total
0    Luís Gonçalves  Brazil   Jane Peacock   3.98
1    Luís Gonçalves  Brazil   Jane Peacock   3.96
2    Luís Gonçalves  Brazil   Jane Peacock   5.94
3    Luís Gonçalves  Brazil   Jane Peacock   0.99
4    Luís Gonçalves  Brazil   Jane Peacock   1.98
..              ...     ...            ...    ...
407      Luis Rojas   Chile  Steve Johnson  17.91
408      Luis Rojas   Chile  Steve Johnson   1.98
409      Luis Rojas   Chile  Steve Johnson   3.96
410      Luis Rojas   Chile  Steve Johnson   5.94
411      Luis Rojas   Chile  Steve Johnson   0.99

[412 rows x 4 columns]

## Ex5

In [17]:
query = '''
SELECT ii.InvoiceLineId, t.Name as 'Song Name'
FROM invoice_items ii
JOIN tracks t ON ii.TrackId = t.TrackId
'''
pd.read_sql_query(query, conn)

      InvoiceLineId                                          Song Name
0               579            For Those About To Rock (We Salute You)
1                 1                                  Balls to the Wall
2              1154                                  Balls to the Wall
3              1728                                    Fast As a Shark
4                 2                                  Restless and Wild
...             ...                                                ...
2235           1726  Symphony No. 2, Op. 16 -  "The Four Temperamen...
2236            577    Étude 1, In C Major - Preludio (Presto) - Liszt
2237           1153  Pini Di Roma (Pinien Von Rom) \ I Pini Della V...
2238            578  String Quartet No. 12 in C Minor, D. 703 "Quar...
2239           1727  String Quartet No. 12 in C Minor, D. 703 "Quar...

[2240 rows x 2 columns]

## Ex6

In [18]:
query = '''
SELECT t.Name as 'Song Name', m.Name as 'Format', a.Title as 'Album Name', g.Name as 'Genre'
FROM tracks t
JOIN genres g ON t.GenreId = g.GenreId
JOIN albums a ON t.AlbumId = a.AlbumId
JOIN media_types m on t.MediaTypeId = m.MediaTypeId
'''
pd.read_sql_query(query, conn)

,Song Name,Format,Album Name,Genre
0,For Those About To Rock (We Salute You),MPEG audio file,For Those About To Rock We Salute You,Rock
1,Balls to the Wall,Protected AAC audio file,Balls to the Wall,Rock
2,Fast As a Shark,Protected AAC audio file,Restless and Wild,Rock
3,Restless and Wild,Protected AAC audio file,Restless and Wild,Rock
4,Princess of the Dawn,Protected AAC audio file,Restless and Wild,Rock
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,Protected AAC audio file,Respighi:Pines of Rome,Classical
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Protected AAC audio file,Schubert: The Late String Quartets & String Qu...,Classical
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Protected AAC audio file,Monteverdi: L'Orfeo,Classical
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Protected AAC audio file,Mozart: Chamber Music,Classical
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",Protected AAC audio file,Mozart Gala: Famous Arias,Opera

## Ex7

In [19]:
query = '''
SELECT p.Name as 'Playlist Name', COUNT(*) as 'Number of Songs in Playlist'
FROM playlists p
LEFT JOIN playlist_track pt ON p.PlaylistId = pt.PlaylistId 
GROUP BY p.PlaylistID
'''
pd.read_sql_query(query, conn)

                 Playlist Name  Number of Songs in Playlist
0                        Music                         3290
1                       Movies                            1
2                     TV Shows                          213
3                   Audiobooks                            1
4                   90’s Music                         1477
5                   Audiobooks                            1
6                       Movies                            1
7                        Music                         3290
8                 Music Videos                            1
9                     TV Shows                          213
10             Brazilian Music                           39
11                   Classical                           75
12   Classical 101 - Deep Cuts                           25
13  Classical 101 - Next Steps                           25
14  Classical 101 - The Basics                           25
15                      Grunge                           15
16         Heavy Metal Classic                           26
17                 On-The-Go 1                            1

## Ex8

In [20]:
query = '''
SELECT e.FirstName || ' ' || e.LastName as 'Employee Name', SUM(i.Total) as 'Total Sold'
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
GROUP BY e.EmployeeId
'''
pd.read_sql_query(query, conn)

   Employee Name  Total Sold
0   Jane Peacock      833.04
1  Margaret Park      775.40
2  Steve Johnson      720.16

## Ex9

In [21]:
query = '''
SELECT e.FirstName || ' ' || e.LastName as 'Employee Name', SUM(i.Total) as 'Total Sold (2009)'
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE i.InvoiceDate LIKE '2009%'
GROUP BY e.EmployeeId
ORDER BY SUM(i.Total) DESC
'''
pd.read_sql_query(query, conn)

   Employee Name  Total Sold (2009)
0  Steve Johnson             164.34
1  Margaret Park             161.37
2   Jane Peacock             123.75

## Ex10

In [22]:
query = '''
SELECT ar.Name, SUM(ii.UnitPrice) as 'Sales'
FROM artists ar
JOIN albums al ON ar.ArtistId = al.ArtistId 
JOIN tracks t ON al.AlbumId = t.AlbumId
JOIN invoice_items ii ON t.TrackId = ii.TrackId
GROUP BY ar.ArtistId
ORDER BY COUNT(*) DESC
LIMIT 3;
'''
pd.read_sql_query(query, conn)

          Name   Sales
0  Iron Maiden  138.60
1           U2  105.93
2    Metallica   90.09

## Cerrar conexion con base de datos

In [23]:
conn.close()

# Murder Mystery

In [24]:
# Cargar la base de datos
conn = sqlite3.connect('sql_murder_mystery.db')

In [25]:
query = '''
SELECT *
FROM crime_scene_report
WHERE date = '20180115' and type = 'murder' and city = 'SQL City'
'''
pd.read_sql_query(query, conn)

,date,type,description,city
0,20180115,murder,Security footage shows that there were 2 witne...,SQL City

In [26]:
cursor = conn.cursor()
mi_query = cursor.execute(query)
print('Description:\n', mi_query.fetchall()[0][2])

Description:
 Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".

In [27]:
# A investigar segun esas pistas
# Sospechoso numero 1
query = '''
SELECT *
FROM person
WHERE address_street_name = 'Northwestern Dr'
ORDER BY address_number DESC
LIMIT 1
'''
pd.read_sql_query(query, conn)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [28]:
# Sospechosa numero 2
query = '''
SELECT *
FROM person
WHERE name LIKE 'Annabel%' and address_street_name = 'Franklin Ave'
'''
pd.read_sql_query(query, conn)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [29]:
# Ya sabemos los 2 testigos vamos a unirlos con sus interviews
query = '''
SELECT p.id, p.name, i.transcript
FROM person p
JOIN interview i ON p.id = i.person_id
WHERE p.name = 'Morty Schapiro' or p.name = 'Annabel Miller'
'''
pd.read_sql_query(query, conn)

      id            name                                         transcript
0  14887  Morty Schapiro  I heard a gunshot and then saw a man run out. ...
1  16371  Annabel Miller  I saw the murder happen, and I recognized the ...

In [30]:
mi_query = cursor.execute(query)
print('Transcript Morty:\n', mi_query.fetchall()[0][2])

Transcript Morty:
 I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".

In [31]:
mi_query = cursor.execute(query)
print('Transcript Annabel:\n', mi_query.fetchall()[1][2])

Transcript Annabel:
 I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.

In [32]:
# A ver la info sobre el gimnasio
query = '''
SELECT gm.name, gc.membership_id ,gm.membership_status, gc.check_in_date, d.plate_number
FROM get_fit_now_member gm
JOIN get_fit_now_check_in gc ON gm.id = gc.membership_id
JOIN person p ON gm.person_id = p.id
JOIN drivers_license d ON p.license_id = d.id
WHERE gm.membership_status = 'gold' and  gc.check_in_date = '20180109' and gc.membership_id LIKE '48Z%' and d.plate_number LIKE '%H42W%'
'''
pd.read_sql_query(query, conn)

            name membership_id membership_status  check_in_date plate_number
0  Jeremy Bowers         48Z55              gold       20180109       0H42W2

In [33]:
# Tenemos al asesino, a ver su testimonio
query = '''
SELECT p.id, p.name, i.transcript
FROM person p
JOIN interview i ON p.id = i.person_id
WHERE p.name = 'Jeremy Bowers'
'''
pd.read_sql_query(query, conn)

      id           name                                         transcript
0  67318  Jeremy Bowers  I was hired by a woman with a lot of money. I ...

In [34]:
mi_query = cursor.execute(query)
print('Transcript Jeremy:\n', mi_query.fetchall()[0][2])

Transcript Jeremy:
 I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5" (65") or 5'7" (67"). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.

In [35]:
# A ver a la mujer rica esta
query = '''
SELECT person_id, COUNT(event_name) as 'Times Attended in December'
FROM facebook_event_checkin
WHERE date LIKE '201712%' and event_name = 'SQL Symphony Concert'
GROUP BY person_id
ORDER BY COUNT(event_name) DESC
'''
pd.read_sql_query(query, conn)

    person_id  Times Attended in December
0       99716                           3
1       24556                           3
2       28582                           2
3       92343                           1
4       81526                           1
5       79312                           1
6       69699                           1
7       69325                           1
8       67318                           1
9       62596                           1
10      58898                           1
11      43366                           1
12      24397                           1
13      19292                           1
14      19260                           1
15      11173                           1

In [36]:
# Con esos 2 person_ids podemos jugar
query = '''
SELECT *
FROM person
WHERE id = 99716 OR id = 24556
'''
pd.read_sql_query(query, conn)

,id,name,license_id,address_number,address_street_name,ssn
0,24556,Bryan Pardo,101191,703,Machine Ln,816663882
1,99716,Miranda Priestly,202298,1883,Golden Ave,987756388

In [37]:
# Solo Miranda es mujer, nos deberia valer, pero lo confirmamos con el coche
query = '''
SELECT p.name, p.license_id, d.height, d.hair_color, d.gender, d.car_make, d.car_model
FROM person p
JOIN drivers_license d ON p.license_id = d.id
WHERE p.id = 99716 OR p.id = 24556
'''
pd.read_sql_query(query, conn)

               name  license_id  height hair_color  gender car_make car_model
0  Miranda Priestly      202298      66        red  female    Tesla   Model S

In [38]:
conn.close()

# Ale ya tenemos al asesino y a la que le contrato!!